package ru.evotor.sdk.payment.enums

enum class Currency(var code: Int, e: Int) {
    /**
     * Аргентинское песо
     */
    ARS(32, 2),

    /**
     * Брунейский доллар
     */
    BND(96, 2),

    /**
     * Боливийский боливиано
     */
    BOB(68, 2),

    /**
     * Бразильский реал
     */
    BRL(986, 2),

    /**
     * Канадский доллар
     */
    CAD(124, 2),

    /**
     * Чилийское песо
     */
    CLP(152, 0),

    /**
     * Колумбийское песо
     */
    COP(170, 2),

    /**
     * Коста-риканский колон
     */
    CRC(188, 2),

    /**
     * Кубинский песо
     */
    CUP(192, 2),

    /**
     * Доминиканское песо
     */
    DOP(214, 2),

    /**
     * Евро
     */
    EUR(978, 2),

    /**
     * Гондурасская лемпира
     */
    HNL(340, 2),

    /**
     * Гаитянский гурд
     */
    HTG(332, 2),

    /**
     * Индонезийская рупия
     */
    IDR(360, 2),

    /**
     * Камбоджийский риель
     */
    KHR(116, 0),

    /**
     * Южнокорейская вона
     */
    KRW(410, 2),

    /**
     * Лаосский кип
     */
    LAK(418, 3),

    /**
     * Мьянманский кьят
     */
    MMK(104, 2),

    /**
     * Мексиканское песо
     */
    MXN(484, 2),

    /**
     * Малайзийский ринггит
     */
    MYR(458, 2),

    /**
     * Никарагуанская кордоба
     */
    NIO(558, 2),

    /**
     * Панамский бальбоа
     */
    PAB(590, 2),

    /**
     * Перуанский соль
     */
    PEN(604, 2),

    /**
     * Филиппинское песо
     */
    PHP(608, 2),

    /**
     * Парагвайский гуарани
     */
    PYG(600, 2),

    /**
     * Российский рубль
     */
    RUB(643, 2),

    /**
     * Сингапурский доллар
     */
    SGD(702, 2),

    /**
     * Тайский бат
     */
    THB(764, 2),

    /**
     * Доллар США
     */
    USD(840, 2),

    /**
     * Уругвайское песо
     */
    UYU(858, 2),

    /**
     * Вьетнамский донг
     */
    VND(704, 0)
}