package ru.evotor.sdk.payment.enums

enum class ReaderEvent {
    /**
     * Не удалось считать данные магнитной ленты
     */
    BAD_SWIPE,

    /**
     * Превышен таймаут ожидания карты
     */
    CARD_TIMEOUT,

    /**
     * Считыватель карт был подключен
     */
    CONNECTED,

    /**
     * Считыватель карт был отключен
     */
    DISCONNECTED,

    /**
     * Пользователь может извлечь карту (возникает при ошибке
    проведения транзакции)
     */
    EJECT_CARD,

    /**
     * Не используется
     */
    EJECT_CARD_TIMEOUT,

    /**
     * Начата чиповая транзакция
     */
    EMV_TRANSACTION_STARTED,

    /**
     * Произошла ошибка инициализации
     */
    INIT_FAILED,

    /**
     * Инициализация завершена успешно
     */
    INIT_SUCCESSFULLY,

    /**
     * Уровень заряда батареи считывателя карт менее 10%
     */
    LOW_BATTERY,

    /**
     * Начата NFC транзакция
     */
    NFC_TRANSACTION_STARTED,

    /**
     * Платеж отменен пользователем
     */
    PAYMENT_CANCELED,

    /**
     * Превышен таймаут ожидания карты
     */
    PIN_TIMEOUT,

    /**
     * Начало инициализации
     */
    START_INIT,

    /**
     * Обнаружено проведение магнитной полосой
     */
    SWIPE_CARD,

    /**
     * Ожидание проведения магнитной полосой или вставки
    чиповой карты
     */
    WAITING_FOR_CARD
}